library(ggplot2)
library(gMOIP)
library(lpSolve)


C <- c(1, rep(0,12))
C

A <- matrix(c(1,-1,rep(0,5),-1,rep(0,2),-1,0,-1,
              0,1.015,-1,rep(0,10),
              rep(0,2),1.015,-1,rep(0,3),1.035,-1,rep(0,4),
              rep(0,3),1.015,-1,rep(0,5),1.06,-1,0,
              rep(0,4),1.015,-1,rep(0,2),1.035,-1,rep(0,3),
              rep(0,5),1.015,-1,rep(0,6),
              rep(0,6),1.015,rep(0,2),1.035,0,1.06,1.11), byrow = TRUE, ncol = 13, nrow = 7)
colnames(A) <- c('y', 'A_1', 'A_2', 'A_3', 'A_4', 'A_5', 'A_6', 'B_1', 'B_3', 'B_5', 'C_1', 'C_4', 'D_1')
b <- c( rep(0,2),150,rep(0,3),600 )

A
b
C

constraints_direction <- rep('=',7)
constraints_direction

mod <- lp(direction = "min", objective.in = C,
          const.mat = A, const.dir = constraints_direction, const.rhs = b,
          compute.sens = TRUE)

mod$status # 0
mod$solution
# [1] 678.9254   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000 144.9275   0.0000
# [10]   0.0000 533.9979 566.0377   0.0000
mod$objval # 678.9254


####
# Стоимость 1 рубля, к-рый надо выплатить в начале седьмого мес?
b1 <- c( rep(0,2),150,rep(0,3),600+0.001 )
b1
# размерность в тыс. руб.

mod1 <- lp(direction = "min", objective.in = C,
           const.mat = A, const.dir = constraints_direction, const.rhs = b1,
           compute.sens = TRUE)

mod1$status # 0
mod1$solution
mod1$objval # 678.9263

mod1$objval - mod$objval # 0.0008899964 -- стоимость 1 доп. руб. в тыс. руб.
(mod1$objval - mod$objval) * 1000 # 0.8899964 -- стоимость 1 доп. руб.

####
mod$duals
# 1.000000000 0.980676329 0.966183575 0.943396226 0.921146315 0.903346387
# [7] ((0.889996440)) 0.000000000 0.004613527 0.000000000 0.008636405 0.008432716
# [13]  0.004249733   0.000000000 0.000000000 0.012797138 0.000000000 0.000000000
# [19]  0.000000000   0.012103952

mod$duals.from
# [1] -6.789254e+02 -1.477833e+02  2.842171e-14 -5.660377e+02 -5.797101e+02 -5.911330e+02  ((2.273737e-13))
# [8] -1.000000e+30  0.000000e+00 -1.000000e+30 -1.500000e+02  0.000000e+00  0.000000e+00 -1.000000e+30
# [15] -1.000000e+30  0.000000e+00 -1.000000e+30 -1.000000e+30 -1.000000e+30 -5.609122e+04

mod$duals.to 
# [1] 1.000000e+30 0.000000e+00 1.000000e+30 1.000000e+30 0.000000e+00 0.000000e+00
# [7] ((1.000000e+30)) 1.000000e+30 1.455993e+02 1.000000e+30 5.576726e+02 5.711430e+02
# [13] 0.000000e+00 1.000000e+30 1.000000e+30 5.601064e+02 1.000000e+30 1.000000e+30
# [19] 1.000000e+30 5.405405e+02


# [7]: 1.000000e+30 => 3-я Th двойственности выполняется
# \Delta z = \Delta b_7 \cdot y*_7 = 0.89 * 0.001 -- в тыс. руб.
# 1000 * \Delta b_7 = 0.89 -- в руб.




########
b2 <- c( rep(0,2),150,0,0+0.001,0,600 )
mod2 <- lp(direction = "min", objective.in = C,
           const.mat = A, const.dir = constraints_direction, const.rhs = b2,
           compute.sens = TRUE)
mod2$status # 0
mod2$solution
mod2$objval # 678.9263
mod2$objval - mod$objval # 0.0009294544 -- стоимость 1 доп. руб. в тыс. руб.
(mod2$objval - mod$objval) * 1000 # 0.9294544 -- стоимость 1 доп. руб.


mod$duals
mod$duals.to # [5]: 0.000000e+00 => 3-я Th двойственности НЕ выполняется