library(lpSolve)

C <- c( rep(0,8),1 )
b <- c( 20,rep(0,3),rep(10,5) )
constraints_direction <- c( rep('=',4),rep('<=',5) )
A <- matrix( c(1,0,1,0,1,1,rep(0,3),
               0.3,-1,rep(0,3),1.06,-1,rep(0,2),
               1,0.3,0,-1,1.2,0,1.06,-1,0,
               0,1,1.75,1.4,rep(0,3),1.06,-1,
               1,rep(0,8),
               0,1,rep(0,7),
               rep(0,2),1,rep(0,6),
               rep(0,3),1,rep(0,5),
               rep(0,4),1,rep(0,4)), byrow=TRUE, ncol=9, nrow=9 )
C
b
constraints_direction
A

mod <- lp(direction='max', objective.in=C, 
          const.mat=A, const.dir=constraints_direction, const.rhs=b,
          compute.sens=TRUE)

mod$status # 0 -- success
mod$solution
# 10.000  3.000 10.000 10.000  0.000  0.000  0.000  0.900 35.454
mod$objval # 35.454

b1 <- c( 20+(0.1)^6,rep(0,3),rep(10,5) )

mod1 <- lp(direction='max', objective.in=C, 
           const.mat=A, const.dir=constraints_direction, const.rhs=b1,
           compute.sens=TRUE)

mod1$status # 0 -- success
mod1$solution
# 10.0000000  3.0000011 10.0000000 10.0000000  0.0000000  0.0000010  0.0000000  0.9000003 35.4540014
mod1$objval # 35.454

####
(mod1$objval - mod$objval) * 10^6 # 1.39708


#######
mod$duals
# [1]  ((1.45540)) -1.31800 -1.06000 -1.00000  0.00000  0.00000  0.29460  0.34000  0.00000  0.00000  0.00000
# [12]  0.00000  0.00000 -0.18340 -0.05832 -0.19440  0.00000  0.00000

mod$duals.from
# [1]  ((1.917431e+01)) -7.000000e+00 -1.000000e+30 -1.000000e+30 -1.000000e+30 -1.000000e+30  1.000000e+01
# [8]  0.000000e+00 -1.000000e+30 -1.000000e+30 -1.000000e+30 -1.000000e+30 -1.000000e+30  0.000000e+00
# [15]  0.000000e+00 -1.184211e+00 -1.000000e+30 -1.000000e+30

mod$duals.to
# [1] ((2.000000e+01)) 3.000000e+00 9.000000e-01 3.545400e+01 1.000000e+30 1.000000e+30 1.082569e+01
# [8] 1.090000e+01 1.000000e+30 1.000000e+30 1.000000e+30 1.000000e+30 1.000000e+30 1.000000e+01
# [15] 1.165803e+00 3.000000e+00 1.000000e+30 1.000000e+30

## b_1 можно менять в интервале: (1.917431e+01, 2.000000e+01) = (19.2, 20.0), чтобы y* \equiv
## => 3-я Th двойственности НЕ вып-ся

