## Формализация задачи ##
# 1 квартал, 1 смена -- можно произвести макс. 1200
# 1 квартал, 1 смена -- можно произвести макс. 800
# Аналогично для всех последующих периодов
#
# ((x_{ij}, c_{ij}))
#
#       1000        700            3100          2500
# 1200  (x_11, 10)  (x_12, 10.5)   (x_13, 11)    (x_14, 11.5)
# 800   (x_21, 11)  (x_22, 11.5)   (x_23, 12)    (x_24, 12.5)
# 1200  (x_31, B)   (x_32, 10)     (x_33, 10.5)  (x_34, 11)
# 800   (x_41, B)   (x_42, 11)     (x_43, 11.5)  (x_44, 12)
# 1200  (x_51, B)   (x_52, B)      (x_53, 10)    (x_54, 10.5)
# 800   (x_61, B)   (x_62, B)      (x_63, 11)    (x_64, 11.5)
# 1200  (x_71, B)   (x_72, B)      (x_73, B)     (x_74, 10)
# 800   (x_81, B)   (x_82, B)      (x_83, B)     (x_84, 11)


library(lpSolve)

#составим матрицу издержек производства
cost.mat <- matrix(c(10, 10.5, 11, 11.5,
                     11, 11.5, 12, 12.5,
                     99, 10, 10.5, 11,
                     99, 11, 11.5, 12,
                     99, 99, 10, 10.5, 
                     99, 99, 11, 11.5,
                     99, 99, 99, 10,
                     99, 99, 99, 11), ncol = 4, byrow = TRUE)


#направление оптимизации (минимизируем общие издержки)
direction = "min"

#макисмальное производство каждой смены в каждый из кварталов
#можем производить меньше максимума, потому ограничения не строгие
row.signs <- rep("<=",8) # для рав-ва задача не будет иметь решений, т.к. будет несбалансированной
row.rhs <- rep(c(1200, 800), 4)

#спрос в каждый из кварталов (он фиксирован, ограничения строгие)
col.signs <- rep("=",4)
col.rhs <- c(1000, 700, 3100, 2500)

#решение задачи
mod <- lp.transport(cost.mat = cost.mat,
                    direction = direction,
                    row.signs = row.signs,
                    row.rhs = row.rhs,
                    col.signs = col.signs,
                    col.rhs = col.rhs,
                    compute.sens = 0)

#значение целевой функции
mod

#оптимальны график производства
# mod$solution
# [,1] [,2] [,3] [,4]
# [1,] 1000    0    0  200 <- произвели в 1-м квартале, но продали в 4-м квартале
# [2,]    0    0    0  100
# [3,]    0    0 1200    0
# [4,]    0  700  100    0
# [5,]    0    0 1000  200
# [6,]    0    0  800    0
# [7,]    0    0    0 1200
# [8,]    0    0    0  800

